---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadThickness
source: html/2db1c1ca-1263-e187-0633-1845df45e0a6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrTreadThickness Property

"Tread Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrTreadThickness { get; }
```